# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors: 3

#Model Summary: 344 layers, 3972642 parameters, 3972642 gradients, 14.0 GFLOPS

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.SiLU()]],  # 0-P1/2
   [-1, 1, CBAM, [32]],
  
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.SiLU()]],  # 1-P2/4

   [-1, 1, Yolov7_Tiny_E_ELAN, [64, 32, nn.SiLU()]], # 2

   [-1, 1, MP, []],  # 3-P3/8
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 64, nn.SiLU()]], # 5

   [-1, 1, MP, []],  # 5-P4/16
   [-1, 1, Yolov7_Tiny_E_ELAN, [256, 64, nn.SiLU()]], # 7

   [-1, 1, MP, []],  # 7-P5/32                          8
#   [-1, 1, Yolov7_Tiny_E_ELAN, [512, 256, nn.SiLU()]], # 8
  ]

# yolov7-tiny head
head:
  [[-1, 1, Yolov7_Tiny_SPP, [256, nn.SiLU()]], # 9-Yolov7-tiny-spp
   
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.SiLU()]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [7, 1, Conv, [128, 1, 1, None, 1, nn.SiLU()]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 64, nn.SiLU()]], # 14

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.SiLU()]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [5, 1, Conv, [64, 1, 1, None, 1, nn.SiLU()]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Yolov7_Tiny_E_ELAN, [64, 32, nn.SiLU()]], # 19
   
   [-1, 1, Conv, [32, 1, 1, None, 1, nn.SiLU()]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [3, 1, Conv, [32, 1, 1, None, 1, nn.SiLU()]], # route backbone P2
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, VoVGSCSP, [64]], # 24

   [-1, 1, GSConv, [64, 3, 2, None, 1, nn.SiLU()]],
   [[-1, 19], 1, Concat, [1]],
   [-1, 1, VoVGSCSP, [128]], # 27

   [-1, 1, GSConv, [128, 3, 2, None, 1, nn.SiLU()]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 1, VoVGSCSP, [128]], # 30

   [24, 1, GSConv, [64, 3, 1, None, 1, nn.SiLU()]], # 31-P2
   [27, 1, GSConv, [128, 3, 1, None, 1, nn.SiLU()]], # 32-P3
   [30, 1, GSConv, [256, 3, 1, None, 1, nn.SiLU()]], # 33-P4

   [[31, 32, 33], 1, IDetect, [nc, anchors]],   # Detect(P2, P3, P4)

  ]